code-review/NRB_3471_3546/База_Было/Documents/ЗапросСубброкеруНаРаскрытие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗапросСубброкеруНаРаскрытие</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерДокументаСубброкера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаСубброкера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодLEI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДЕПО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДЕПО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеференсКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКорпоративныхДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТипаКорпоративногоДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорпоративноеДействие_Новый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеференсКДСвязанный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКДСвязанный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКорпоративныхДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КДСвязанный</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорпоративноеДействие_Новый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСВ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСпискаЛиц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименованиеЭмитента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ISIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосРегНомерВыпуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяОтправкиЗапроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументаЗапросСубброкеруНаРаскрытие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторныйЗапрос</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелоСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлениеКлиентам</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УведомлениеКлиентам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеСубброкера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ISIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LEIКодСубброкера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресМестонахожденияРегистрацииАдрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресМестонахожденияРегистрацииИндекс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресМестонахожденияРегистрацииСтрана</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресПочтовыйАдрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресПочтовыйИндекс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресПочтовыйСтрана</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выгодоприобретатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГражданствоФЛ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРожденияФЛ</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВладельцаДатаВыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВладельцаНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВладельцаОрганВыдачи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВладельцаСерия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВладельцаТип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДокументыЮридическихЛиц</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ДокументыУдостоверяющиеЛичность</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявленнаяНалоговаяСтавка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодКлиента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодНРД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеНалоговыхЛьгот</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеНаименованиеЛица</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеНаименованиеЮЛФЛСубклиента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакЮЛФЛ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусНалогоплательщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/AccumulationRegisters/ОстаткиЦБМестоРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиЦБМестоРасчетов</Name>
			<Comment>Остатки ЦБ по дате исполнения в месте расчетов</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусЦБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ТипыКорпоративныхДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКорпоративныхДействий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Добровольное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обязательное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобровольноеИнструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ТипЗагрузкиСписковРаскрытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипЗагрузкиСписковРаскрытия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>PARTAD</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ISO20022</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FCDR_2017_02</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ЗапросСубброкеруНаРаскрытие/Ext/ManagerModule.bsl
// Создает временную таблицу втИсточникДляРаскрытия и заполняет ее по данным документа запроса субброкера
//
// Параметры:
//  МВТ			 - МенеджерВременныхТаблиц	- менеджер в котором будет создана временная таблица втИсточникДляРаскрытия
//  ЗапросНаРСВ	 - ДокументСсылка.ЗапросСубброкеруНаРаскрытие	- запрос по которому создается ВТ
//
Процедура ДобавитьИсточникДляРаскрытияИзЗапросаНаРСВ(МВТ, ЗапросНаРСВ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗапросСубброкеруНаРаскрытие.Клиент КАК Субброкер,
	|	ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ЗапросСубброкеруНаРаскрытие.СчетДЕПО КАК СчетДепо,
	|	ВЫБОР
	|		КОГДА ЗапросСубброкеруНаРаскрытие.ВидКД.Код <> &WTRC
	|				И ЗапросСубброкеруНаРаскрытие.РеференсКДСвязанный <> """"
	|			ТОГДА ЗапросСубброкеруНаРаскрытие.РеференсКДСвязанный
	|		ИНАЧЕ ЗапросСубброкеруНаРаскрытие.РеференсКД
	|	КОНЕЦ КАК КДРеференс,
	|	ВЫБОР
	|		КОГДА ЗапросСубброкеруНаРаскрытие.ВидКД.Код <> &WTRC
	|				И ЗапросСубброкеруНаРаскрытие.РеференсКДСвязанный <> """"
	|			ТОГДА ЗапросСубброкеруНаРаскрытие.ВидКДСвязанный.Наименование
	|		ИНАЧЕ ЗапросСубброкеруНаРаскрытие.ВидКД.Наименование
	|	КОНЕЦ КАК ТипКД,
	|	ВЫБОР
	|		КОГДА ЗапросСубброкеруНаРаскрытие.ВидКД.Код <> &WTRC
	|				И ЗапросСубброкеруНаРаскрытие.РеференсКДСвязанный <> """"
	|			ТОГДА ЗапросСубброкеруНаРаскрытие.ВидКДСвязанный.Код
	|		ИНАЧЕ ЗапросСубброкеруНаРаскрытие.ВидКД.Код
	|	КОНЕЦ КАК КодТипаКД,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЗапросСубброкеруНаРаскрытие.ВидКД.Код <> &WTRC
	|						И ЗапросСубброкеруНаРаскрытие.РеференсКДСвязанный <> """"
	|					ТОГДА ЗапросСубброкеруНаРаскрытие.ВидКДСвязанный.ТипКорпоративныхДействий
	|				ИНАЧЕ ЗапросСубброкеруНаРаскрытие.ВидКД.ТипКорпоративныхДействий
	|			КОНЕЦ = &Доход
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВидКДВыплатаДоходов,
	|	ВЫБОР
	|		КОГДА ЗапросСубброкеруНаРаскрытие.ВидКД.Код <> &WTRC
	|				И ЗапросСубброкеруНаРаскрытие.РеференсКДСвязанный <> """"
	|			ТОГДА ЗапросСубброкеруНаРаскрытие.ВидКДСвязанный.КодДохода
	|		ИНАЧЕ ЗапросСубброкеруНаРаскрытие.ВидКД.КодДохода
	|	КОНЕЦ КАК КодДоходовНДФЛ,
	|	ИСТИНА КАК ЗаполнятьЗаявленнуюНалоговуюСтавку,
	|	ЕСТЬNULL(КорпоративноеДействие_Новый.ДатаФиксации, РаскрытиеСпискаВладельцев.ДатаФиксации) КАК ДатаФиксации,
	|	ЕСТЬNULL(ЦеннаяБумагаЗапроса.Ссылка, ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка)) КАК ЦеннаяБумага,
	|	ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.Выгодоприобретатель КАК Субклиент,
	|	""01"" КАК ТипСчета,
	|	ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.Количество КАК Количество,
	|	ЗапросСубброкеруНаРаскрытие.РСВ.Дата КАК ДатаДокументаРаскрытия,
	|	ЗапросСубброкеруНаРаскрытие.РСВ.Организация КАК Организация,
	|	КодыЗагрузкиОрганизации.Код КАК КодЗагрузкиНДЦОрганизации,
	|	ЕСТЬNULL(РаскрытиеСпискаВладельцев.Организация.Наименование, КорпоративноеДействие_Новый.Организация.Наименование) КАК НаименованиеЮЛОрганизации,
	|	ЕСТЬNULL(ЦеннаяБумагаЗапроса.НаименованиеВыпуска, """") КАК НаименованиеВыпуска,
	|	ЕСТЬNULL(РаскрытиеСпискаВладельцев.ДатаОкончанияПриемаИнструкцийВТБКБ, КорпоративноеДействие_Новый.ДатаОкончанияПриемаИнструкцийВТБКБ) КАК ДатаОкончанияПриемаИнструкцийВТБКБ,
	|	ИСТИНА КАК ВыводитьСтрокиТаблицы,
	|	ЗапросСубброкеруНаРаскрытие.Дата КАК ДатаДокументаЗапроса
	|ПОМЕСТИТЬ втИсточникДляРаскрытия
	|ИЗ
	|	Документ.ЗапросСубброкеруНаРаскрытие.ДанныеСубброкера КАК ЗапросСубброкеруНаРаскрытиеДанныеСубброкера
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
	|		ПО ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.Ссылка = ЗапросСубброкеруНаРаскрытие.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиОрганизации
	|		ПО (КодыЗагрузкиОрганизации.Владелец = ЕСТЬNULL(ЗапросСубброкеруНаРаскрытие.РСВ.Организация.ЮридическоеЛицо, ЗапросСубброкеруНаРаскрытие.КД.Организация.ЮридическоеЛицо))
	|			И ((ВЫРАЗИТЬ(КодыЗагрузкиОрганизации.Биржа КАК Справочник.КлассификаторыЗагрузки)) = &НДЦ)
	|			И (КодыЗагрузкиОрганизации.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузкиОрганизации.ДатаОкончанияДействия > &ДатаСреза)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаскрытиеСпискаВладельцев КАК РаскрытиеСпискаВладельцев
	|		ПО (РаскрытиеСпискаВладельцев.Ссылка = ЗапросСубброкеруНаРаскрытие.РСВ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорпоративноеДействие_Новый КАК КорпоративноеДействие_Новый
	|		ПО (КорпоративноеДействие_Новый.Ссылка = ЗапросСубброкеруНаРаскрытие.КД)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦеннаяБумагаЗапроса
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|			ПО (КодыЗагрузки.Владелец = ЦеннаяБумагаЗапроса.Ссылка)
	|				И ((ВЫРАЗИТЬ(КодыЗагрузки.Биржа КАК Справочник.КлассификаторыЗагрузки)) = &НДЦ)
	|		ПО (ЦеннаяБумагаЗапроса.ISIN = ЗапросСубброкеруНаРаскрытие.ISIN)
	|			И (ЦеннаяБумагаЗапроса.НомерРегистрации = ЗапросСубброкеруНаРаскрытие.ГосРегНомерВыпуска)
	|			И (ЦеннаяБумагаЗапроса.Ссылка В (ЕСТЬNULL(КорпоративноеДействие_Новый.ЦеннаяБумага1, РаскрытиеСпискаВладельцев.ЦеннаяБумага1), ЕСТЬNULL(КорпоративноеДействие_Новый.ЦеннаяБумага2, РаскрытиеСпискаВладельцев.ЦеннаяБумага2)))
	|			И (ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.КодНРД = КодыЗагрузки.Код)
	|ГДЕ
	|	ЗапросСубброкеруНаРаскрытие.Ссылка = &ЗапросНаРСВ";
	Запрос.УстановитьПараметр("ЗапросНаРСВ", ЗапросНаРСВ);
	Запрос.УстановитьПараметр("Доход", Перечисления.ТипыКорпоративныхДействий.Доход);
	Запрос.УстановитьПараметр("НДЦ", Константы.КлассификаторЗагрузкиНДЦ.Получить());
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("WTRC", "WTRC");

	Запрос.Выполнить();
	
КонецПроцедуры

Функция ЗапросыСубброкеруКОтправке(РаскрытиеСпискаВладельцевСсылка)
	
	Запрос = Новый Запрос( 
	"ВЫБРАТЬ
	|	ЗапросСубброкеруНаРаскрытие.Клиент,
	|	ЗапросСубброкеруНаРаскрытие.Ссылка,
	|	ЗапросСубброкеруНаРаскрытие.Дата
	|ПОМЕСТИТЬ ЗапросыСубброкеруНаРаскрытие
	|ИЗ
	|	Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
	|ГДЕ
	|	ЗапросСубброкеруНаРаскрытие.Статус = &СтатусСформирован
	|	И ЗапросСубброкеруНаРаскрытие.РСВ = &РСВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапросыСубброкеруНаРаскрытие.Клиент,
	|	МАКСИМУМ(ЗапросыСубброкеруНаРаскрытие.Ссылка) КАК Ссылка,
	|	ЗапросыСубброкеруНаРаскрытие.Дата
	|ПОМЕСТИТЬ СрезПоследних
	|ИЗ
	|	ЗапросыСубброкеруНаРаскрытие КАК ЗапросыСубброкеруНаРаскрытие
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапросыСубброкеруНаРаскрытие.Клиент,
	|	ЗапросыСубброкеруНаРаскрытие.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапросыСубброкеруНаРаскрытие.Клиент КАК Клиент,
	|	ЗапросыСубброкеруНаРаскрытие.Ссылка КАК Ссылка
	|ИЗ
	|	СрезПоследних КАК СрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗапросыСубброкеруНаРаскрытие КАК ЗапросыСубброкеруНаРаскрытие
	|		ПО СрезПоследних.Клиент = ЗапросыСубброкеруНаРаскрытие.Клиент
	|			И СрезПоследних.Дата = ЗапросыСубброкеруНаРаскрытие.Дата");
	
	Запрос.УстановитьПараметр("РСВ",РаскрытиеСпискаВладельцевСсылка);
	Запрос.УстановитьПараметр("СтатусСформирован",Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.Сформирован);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ДанныеЗаполненияУведомленийИЗапросовКОтправке(ДокументыКОтправке)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗапросСубброкеруНаРаскрытие.Ссылка КАК ЗапросСубброкеруСсылка,
	|	ЗапросСубброкеруНаРаскрытие.Клиент КАК Клиент,
	|	ЗапросСубброкеруНаРаскрытие.РазделСчетаДЕПО КАК РазделСчетаДЕПО,
	|	ЗапросСубброкеруНаРаскрытие.СчетДЕПО КАК СчетДЕПО,
	|	ЕСТЬNULL(ЦенныеБумаги.Ссылка, ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка)) КАК ЦеннаяБумага,
	|	ЗапросСубброкеруНаРаскрытие.КД КАК КД,
	|	ЗапросСубброкеруНаРаскрытие.ЗаголовокСообщения КАК Тема,
	|	ЗапросСубброкеруНаРаскрытие.ТелоСообщения КАК Тело,
	|	ЗапросСубброкеруНаРаскрытие.РСВ КАК РСВ,
	|	ЕСТЬNULL(ЗапросСубброкеруНаРаскрытие.КД.ДатаФиксации, ЗапросСубброкеруНаРаскрытие.РСВ.ДатаФиксации) КАК ДатаФиксации,
	|	ЗапросСубброкеруНаРаскрытие.ВидКД.Код КАК ВидКДКод
	|ПОМЕСТИТЬ ЗапросыСубброкеруНаРаскрытие
	|ИЗ
	|	Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаскрытиеСпискаВладельцев КАК РаскрытиеСпискаВладельцев
	|	ПО
	|		РаскрытиеСпискаВладельцев.Ссылка = ЗапросСубброкеруНаРаскрытие.РСВ 
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|	ПО
	|		ЦенныеБумаги.ISIN = ЗапросСубброкеруНаРаскрытие.ISIN 
	|		И ЦенныеБумаги.НомерРегистрации = ЗапросСубброкеруНаРаскрытие.ГосРегНомерВыпуска 
	|		И ЦенныеБумаги.Ссылка В (РаскрытиеСпискаВладельцев.ЦеннаяБумага1, РаскрытиеСпискаВладельцев.ЦеннаяБумага2)
	|		И ЦенныеБумаги.Дробная = ЛОЖЬ
	|ГДЕ
	|	ЗапросСубброкеруНаРаскрытие.Ссылка В(&ДокументыКОтправке)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтправленныеЗапросСубброкеруНаРаскрытие.Клиент КАК Клиент,
	|	ЕСТЬNULL(ЦенныеБумаги.Ссылка, ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка)) КАК ЦеннаяБумага
	|ПОМЕСТИТЬ ОтправленныеЗапросСубброкеруНаРаскрытие
	|ИЗ
	|	Документ.ЗапросСубброкеруНаРаскрытие КАК ОтправленныеЗапросСубброкеруНаРаскрытие
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаскрытиеСпискаВладельцев КАК РаскрытиеСпискаВладельцев
	|	ПО
	|		РаскрытиеСпискаВладельцев.Ссылка = ОтправленныеЗапросСубброкеруНаРаскрытие.РСВ 
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|	ПО
	|		ЦенныеБумаги.ISIN = ОтправленныеЗапросСубброкеруНаРаскрытие.ISIN 
	|		И ЦенныеБумаги.НомерРегистрации = ОтправленныеЗапросСубброкеруНаРаскрытие.ГосРегНомерВыпуска 
	|		И ЦенныеБумаги.Ссылка В (РаскрытиеСпискаВладельцев.ЦеннаяБумага1, РаскрытиеСпискаВладельцев.ЦеннаяБумага2)
	|		И ЦенныеБумаги.Дробная = ЛОЖЬ
	|ГДЕ
	|	ОтправленныеЗапросСубброкеруНаРаскрытие.Статус В(&СтатусыОтправленных)
	|	И ОтправленныеЗапросСубброкеруНаРаскрытие.РСВ В
	|			(ВЫБРАТЬ
	|				ЗапросыСубброкеруНаРаскрытие.РСВ
	|			ИЗ
	|				ЗапросыСубброкеруНаРаскрытие)
	|	И НЕ ОтправленныеЗапросСубброкеруНаРаскрытие.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыЗагрузкиКлиента.Код КАК КодЗагрузки,
	|	КодыЗагрузкиКлиента.Код КАК ClientId,
	|	ЗапросыСубброкеруНаРаскрытие.ЗапросСубброкеруСсылка КАК ЗапросСубброкеруСсылка,
	|	ЗапросыСубброкеруНаРаскрытие.Клиент КАК Клиент,
	|	ЗапросыСубброкеруНаРаскрытие.РазделСчетаДЕПО КАК РазделСчетаДЕПО,
	|	ЗапросыСубброкеруНаРаскрытие.СчетДЕПО КАК СчетДЕПО,
	|	ЗапросыСубброкеруНаРаскрытие.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ЗапросыСубброкеруНаРаскрытие.КД КАК КД,
	|	ЗапросыСубброкеруНаРаскрытие.Тема КАК Тема,
	|	ЗапросыСубброкеруНаРаскрытие.Тело КАК Тело,
	|	ЗапросыСубброкеруНаРаскрытие.РСВ КАК РСВ,
	|	ЗапросыСубброкеруНаРаскрытие.ДатаФиксации КАК ДатаФиксации,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтправленныеЗапросСубброкеруНаРаскрытие.Клиент, ИСТИНА) = ИСТИНА
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПовторныйЗапрос,
	|	ЗапросыСубброкеруНаРаскрытие.ВидКДКод КАК ВидКДКод
	|ИЗ
	|	ЗапросыСубброкеруНаРаскрытие КАК ЗапросыСубброкеруНаРаскрытие
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтправленныеЗапросСубброкеруНаРаскрытие КАК ОтправленныеЗапросСубброкеруНаРаскрытие
	|		ПО ЗапросыСубброкеруНаРаскрытие.Клиент = ОтправленныеЗапросСубброкеруНаРаскрытие.Клиент
	|			И ЗапросыСубброкеруНаРаскрытие.ЦеннаяБумага = ОтправленныеЗапросСубброкеруНаРаскрытие.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиКлиента
	|		ПО ЗапросыСубброкеруНаРаскрытие.Клиент = КодыЗагрузкиКлиента.Владелец
	|			И (НЕ КодыЗагрузкиКлиента.ПометкаУдаления)
	|			И (КодыЗагрузкиКлиента.Биржа = &КлассификаторыЗагрузкиКлиенты)");
	
	СтатусыОтправленных = Новый Массив();
	СтатусыОтправленных.Добавить(Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.Отправлен);
	СтатусыОтправленных.Добавить(Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.ОтправленПовторно);
	СтатусыОтправленных.Добавить(Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.ПолученОтвет);
	
	Запрос.УстановитьПараметр("ДокументыКОтправке", ДокументыКОтправке);
	Запрос.УстановитьПараметр("КлассификаторыЗагрузкиКлиенты", Справочники.КлассификаторыЗагрузки.Клиенты);
	Запрос.УстановитьПараметр("СтатусыОтправленных", СтатусыОтправленных);
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции

Процедура ДобавитьДокументЗапросСубброкераКОтправке(ДокументыКОтправке,ДокументСсылка)
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РаскрытиеСпискаВладельцев") Тогда 
		ЗапросыСубброкера = ЗапросыСубброкеруКОтправке(ДокументСсылка);
		Для Каждого ЗапросСубброкера Из ЗапросыСубброкера Цикл 
			ДокументыКОтправке.Добавить(ЗапросСубброкера);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗапросСубброкеруНаРаскрытие") Тогда
		ДокументыКОтправке.Добавить(ДокументСсылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьДанныеИзЗапросаНаРаскрытие(Данные,ЗапросНаРаскрытие)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	втДанные.Субброкер КАК Субброкер,
	|	втДанные.ВнешнийИсточник КАК ВнешнийИсточник,
	|	втДанные.ПолноеНаименованиеЮЛСубброкера КАК ПолноеНаименованиеЮЛСубброкера,
	|	втДанные.LEIКодСубброкера КАК LEIКодСубброкера,
	|	втДанные.КодСчетаДепоСубброкера КАК КодСчетаДепоСубброкера,
	|	втДанные.КДРеференс КАК КДРеференс,
	|	втДанные.ТипКД КАК ТипКД,
	|	втДанные.КодТипаКД КАК КодТипаКД,
	|	втДанные.ВидКДВыплатаДоходов КАК ВидКДВыплатаДоходов,
	|	втДанные.ДатаФиксации КАК ДатаФиксации,
	|	втДанные.ЦеннаяБумага КАК ЦеннаяБумага,
	|	втДанные.ПолноеНаименованиеЭмитента КАК ПолноеНаименованиеЭмитента,
	|	втДанные.ISIN КАК ISIN,
	|	втДанные.ГосРегНомерВыпуска КАК ГосРегНомерВыпуска,
	|	втДанные.КодСубброкера КАК КодСубброкера,
	|	втДанные.КодСубклиента КАК КодСубклиента,
	|	втДанные.ТипСчета КАК ТипСчета,
	|	втДанные.ПолноеНаименованиеЮЛФЛСубклиента КАК ПолноеНаименованиеЮЛФЛСубклиента,
	|	втДанные.ПризнакЮЛФЛ КАК ПризнакЮЛФЛ,
	|	втДанные.ДатаРожденияФЛ КАК ДатаРожденияФЛ,
	|	втДанные.ГражданствоФЛ КАК ГражданствоФЛ,
	|	втДанные.СтатусНалогоплательщика КАК СтатусНалогоплательщика,
	|	втДанные.КодНРД КАК КодНРД,
	|	втДанные.Количество КАК Количество,
	|	втДанные.ЗаявленнаяНалоговаяСтавкаЧисло КАК ЗаявленнаяНалоговаяСтавкаЧисло,
	|	втДанные.ЗаполнятьЗаявленнуюНалоговуюСтавку КАК ЗаполнятьЗаявленнуюНалоговуюСтавку,
	|	втДанные.АдресМестонахожденияРегистрацииСтрана КАК АдресМестонахожденияРегистрацииСтрана,
	|	втДанные.АдресМестонахожденияРегистрацииИндекс КАК АдресМестонахожденияРегистрацииИндекс,
	|	втДанные.АдресМестонахожденияРегистрацииАдрес КАК АдресМестонахожденияРегистрацииАдрес,
	|	втДанные.АдресПочтовыйСтрана КАК АдресПочтовыйСтрана,
	|	втДанные.АдресПочтовыйИндекс КАК АдресПочтовыйИндекс,
	|	втДанные.АдресПочтовыйАдрес КАК АдресПочтовыйАдрес,
	|	втДанные.ДокументВладельцаТип КАК ДокументВладельцаТип,
	|	втДанные.ДокументВладельцаНомер КАК ДокументВладельцаНомер,
	|	втДанные.ДокументВладельцаСерия КАК ДокументВладельцаСерия,
	|	втДанные.ДокументВладельцаДатаВыдачи КАК ДокументВладельцаДатаВыдачи,
	|	втДанные.ДокументВладельцаОрганВыдачи КАК ДокументВладельцаОрганВыдачи,
	|	втДанные.ДатаДокументаРаскрытия КАК ДатаДокументаРаскрытия,
	|	втДанные.ДатаДокументаЗапроса КАК ДатаДокументаЗапроса,
	|	втДанные.КодЗагрузкиНДЦОрганизации КАК КодЗагрузкиНДЦОрганизации,
	|	втДанные.НаименованиеЮЛОрганизации КАК НаименованиеЮЛОрганизации,
	|	втДанные.НаименованиеВыпуска КАК НаименованиеВыпуска,
	|	втДанные.ДатаОкончанияПриемаИнструкцийВТБКБ КАК ДатаОкончанияПриемаИнструкцийВТБКБ,
	|	втДанные.ВыводитьСтрокиТаблицы КАК ВыводитьСтрокиТаблицы,
	|	втДанные.СчетДепо КАК СчетДепо,
	|	втДанные.Субклиент КАК Субклиент,
	|	втДанные.РазделСчетаДЕПО КАК РазделСчетаДЕПО,
	|	втДанные.НД КАК НД,
	|	втДанные.ИНД КАК ИНД,
	|	втДанные.КодКлиента КАК КодКлиента,
	|	втДанные.ЗаявленнаяНалоговаяСтавка КАК ЗаявленнаяНалоговаяСтавка
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	&втДанные КАК втДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанные.Субброкер КАК Субброкер,
	|	втДанные.ВнешнийИсточник КАК ВнешнийИсточник,
	|	втДанные.ПолноеНаименованиеЮЛСубброкера КАК ПолноеНаименованиеЮЛСубброкера,
	|	втДанные.LEIКодСубброкера КАК LEIКодСубброкера,
	|	втДанные.КодСчетаДепоСубброкера КАК КодСчетаДепоСубброкера,
	|	втДанные.КДРеференс КАК КДРеференс,
	|	втДанные.ТипКД КАК ТипКД,
	|	втДанные.КодТипаКД КАК КодТипаКД,
	|	втДанные.ВидКДВыплатаДоходов КАК ВидКДВыплатаДоходов,
	|	втДанные.ДатаФиксации КАК ДатаФиксации,
	|	втДанные.ЦеннаяБумага КАК ЦеннаяБумага,
	|	втДанные.ПолноеНаименованиеЭмитента КАК ПолноеНаименованиеЭмитента,
	|	втДанные.ISIN КАК ISIN,
	|	втДанные.ГосРегНомерВыпуска КАК ГосРегНомерВыпуска,
	|	втДанные.КодСубброкера КАК КодСубброкера,
	|	втДанные.КодСубклиента КАК КодСубклиента,
	|	втДанные.ТипСчета КАК ТипСчета,
	|	втДанные.ПолноеНаименованиеЮЛФЛСубклиента КАК ПолноеНаименованиеЮЛФЛСубклиента,
	|	втДанные.ПризнакЮЛФЛ КАК ПризнакЮЛФЛ,
	|	втДанные.ДатаРожденияФЛ КАК ДатаРожденияФЛ,
	|	втДанные.ГражданствоФЛ КАК ГражданствоФЛ,
	|	втДанные.СтатусНалогоплательщика КАК СтатусНалогоплательщика,
	|	втДанные.КодНРД КАК КодНРД,
	|	втДанные.Количество КАК Количество,
	|	втДанные.ЗаявленнаяНалоговаяСтавкаЧисло КАК ЗаявленнаяНалоговаяСтавкаЧисло,
	|	втДанные.ЗаполнятьЗаявленнуюНалоговуюСтавку КАК ЗаполнятьЗаявленнуюНалоговуюСтавку,
	|	втДанные.АдресМестонахожденияРегистрацииСтрана КАК АдресМестонахожденияРегистрацииСтрана,
	|	втДанные.АдресМестонахожденияРегистрацииИндекс КАК АдресМестонахожденияРегистрацииИндекс,
	|	втДанные.АдресМестонахожденияРегистрацииАдрес КАК АдресМестонахожденияРегистрацииАдрес,
	|	втДанные.АдресПочтовыйСтрана КАК АдресПочтовыйСтрана,
	|	втДанные.АдресПочтовыйИндекс КАК АдресПочтовыйИндекс,
	|	втДанные.АдресПочтовыйАдрес КАК АдресПочтовыйАдрес,
	|	втДанные.ДокументВладельцаТип КАК ДокументВладельцаТип,
	|	втДанные.ДокументВладельцаНомер КАК ДокументВладельцаНомер,
	|	втДанные.ДокументВладельцаСерия КАК ДокументВладельцаСерия,
	|	втДанные.ДокументВладельцаДатаВыдачи КАК ДокументВладельцаДатаВыдачи,
	|	втДанные.ДокументВладельцаОрганВыдачи КАК ДокументВладельцаОрганВыдачи,
	|	втДанные.ДатаДокументаРаскрытия КАК ДатаДокументаРаскрытия,
	|	втДанные.КодЗагрузкиНДЦОрганизации КАК КодЗагрузкиНДЦОрганизации,
	|	втДанные.НаименованиеЮЛОрганизации КАК НаименованиеЮЛОрганизации,
	|	втДанные.НаименованиеВыпуска КАК НаименованиеВыпуска,
	|	втДанные.ДатаОкончанияПриемаИнструкцийВТБКБ КАК ДатаОкончанияПриемаИнструкцийВТБКБ,
	|	втДанные.ВыводитьСтрокиТаблицы КАК ВыводитьСтрокиТаблицы,
	|	втДанные.СчетДепо КАК СчетДепо,
	|	втДанные.Субклиент КАК Субклиент,
	|	втДанные.РазделСчетаДЕПО КАК РазделСчетаДЕПО,
	|	втДанные.НД КАК НД,
	|	втДанные.ИНД КАК ИНД,
	|	втДанные.КодКлиента КАК КодКлиента,
	|	ЕСТЬNULL(ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.ЗаявленнаяНалоговаяСтавка, втДанные.ЗаявленнаяНалоговаяСтавка) КАК ЗаявленнаяНалоговаяСтавка,
	|	втДанные.ДатаДокументаЗапроса КАК ДатаДокументаЗапроса
	|ИЗ
	|	втДанные КАК втДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапросСубброкеруНаРаскрытие.ДанныеСубброкера КАК ЗапросСубброкеруНаРаскрытиеДанныеСубброкера
	|		ПО (ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.Ссылка = &ЗапросСубброкеруНаРаскрытие)
	|			И втДанные.Субклиент = ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.Выгодоприобретатель");

	Запрос.УстановитьПараметр("втДанные",Данные);
	Запрос.УстановитьПараметр("ЗапросСубброкеруНаРаскрытие",ЗапросНаРаскрытие);
	Данные = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

Функция НовыйДокументЗапросСубброкеруНаРаскрытиеИзКД(КорпоративноеДействие, УведомлениеКлиентам, ДанныеПоСубброкеру)
	
	РеквизитыКорпоративногоДействия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КорпоративноеДействие,"Дата, ДатаОкончанияПриемаИнструкцийНРД, ВидКД,КДРеференсСвязанный, КДРеференсСвязанныйСсылка, ДатаФиксации");
	ТекущаяДата = ТекущаяДатаСеанса();
	ДанныеСубброкера = ДанныеПоСубброкеру[0];
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗапросСубброкеруНаРаскрытие.Ссылка
	|ИЗ
	|	Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
	|ГДЕ
	|	ЗапросСубброкеруНаРаскрытие.КД = &КД
	|	И ЗапросСубброкеруНаРаскрытие.Клиент = &Клиент
	|	И НЕ ЗапросСубброкеруНаРаскрытие.ПометкаУдаления";
	Запрос.УстановитьПараметр("КД", КорпоративноеДействие);
	Запрос.УстановитьПараметр("Клиент", ДанныеСубброкера.Субброкер);
	ПовторныйЗапрос = Не Запрос.Выполнить().Пустой();
	
	ДокументРСВ = РСВПоКД(КорпоративноеДействие);
	ДокЗапросНаРСВ = Документы.ЗапросСубброкеруНаРаскрытие.СоздатьДокумент();
	ДокЗапросНаРСВ.Дата = ТекущаяДата;
	ДокЗапросНаРСВ.РСВ = ДокументРСВ;
	ДокЗапросНаРСВ.УстановитьНовыйНомер();
	ДокЗапросНаРСВ.Клиент = ДанныеСубброкера.Субброкер;
	ДокЗапросНаРСВ.КодLEI = ДанныеСубброкера.LEIКодСубброкера;
	ДокЗапросНаРСВ.СчетДЕПО = ДанныеСубброкера.СчетДепо;
	ДокЗапросНаРСВ.РеференсКД = ДанныеСубброкера.КДРеференс;
	ДокЗапросНаРСВ.ВидКД = РеквизитыКорпоративногоДействия.ВидКД;
	ДокЗапросНаРСВ.КодТипаКорпоративногоДействия = ДокЗапросНаРСВ.ВидКД;
	ДокЗапросНаРСВ.КД = КорпоративноеДействие;
	Если ЗначениеЗаполнено(РеквизитыКорпоративногоДействия.КДРеференсСвязанныйСсылка) Тогда 
		ДокЗапросНаРСВ.РеференсКДСвязанный = РеквизитыКорпоративногоДействия.КДРеференсСвязанный;
		ДокЗапросНаРСВ.ВидКДСвязанный = РеквизитыКорпоративногоДействия.КДРеференсСвязанныйСсылка;
	КонецЕсли;

	ДокЗапросНаРСВ.ДатаСпискаЛиц = РеквизитыКорпоративногоДействия.ДатаФиксации;
	ДокЗапросНаРСВ.ПолноеНаименованиеЭмитента = ДанныеСубброкера.ПолноеНаименованиеЭмитента;
	ДокЗапросНаРСВ.ISIN = ДанныеСубброкера.ISIN;
	ДокЗапросНаРСВ.ГосРегНомерВыпуска = ДанныеСубброкера.ГосРегНомерВыпуска;	
	ДокЗапросНаРСВ.ПовторныйЗапрос = ПовторныйЗапрос;
	ДокЗапросНаРСВ.Статус = Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.Сформирован;	
	Если УведомлениеКлиентам.Ссылка.Пустая() Тогда 
		ДокЗапросНаРСВ.УведомлениеКлиентам = УведомлениеКлиентам.ПолучитьСсылкуНового();
	Иначе 
		ДокЗапросНаРСВ.УведомлениеКлиентам = УведомлениеКлиентам.Ссылка;
	КонецЕсли;
	ДокЗапросНаРСВ.ЗаголовокСообщения = УведомлениеКлиентам.ЗаголовокСообщения;
	ДокЗапросНаРСВ.ТелоСообщения = УведомлениеКлиентам.ТелоСообщения;
	
	Для Каждого Стр Из ДанныеПоСубброкеру Цикл
		НоваяСтрока = ДокЗапросНаРСВ.ДанныеСубброкера.Добавить();
		
		Если Стр.РазделСчетаДепо.РазделСубклиента Тогда  
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		Иначе 
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр, "ISIN, LEIКодСубброкера, КодКлиента, КодНРД, Количество, РазделСчетаДепо");
		КонецЕсли;
		
		НоваяСтрока.Выгодоприобретатель = Стр.Субклиент;
		НоваяСтрока.ПолноеНаименованиеЛица = Стр.ПолноеНаименованиеЮЛФЛСубклиента;
	КонецЦикла;
	ДокЗапросНаРСВ.Записать();	
	Возврат ДокЗапросНаРСВ.Ссылка;
КонецФункции // 

Процедура ОтправитьЗапросСубброкераИУведомлениеКлиентам(ДанныеЗаполнения, Отказ, Тестирование = Ложь) 
	
	ЗапросНаРаскрытие = ДанныеЗаполнения.ЗапросСубброкеруСсылка;
	Если Не (ЗначениеЗаполнено(ДанныеЗаполнения.Тема) И ЗначениеЗаполнено(ДанныеЗаполнения.Тело)) Тогда 
		ТекстСообщения = "Нет текста уведомления в запросе " + ЗапросНаРаскрытие;
		ЗаписьЖурналаРегистрации("Отправка запроса субброкеру на раскрытие",УровеньЖурналаРегистрации.Предупреждение,Метаданные.Документы.ЗапросСубброкеруНаРаскрытие,ЗапросНаРаскрытие,ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	НачатьТранзакцию();
	ДатаФиксации = ДанныеЗаполнения.ДатаФиксации;	
	Уведомление = Новый Структура("Тема, Тело, ФормаСообщенияКК");
	ЗаполнитьЗначенияСвойств(Уведомление, ДанныеЗаполнения);
	Уведомление.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.SendEmailToClients;
	ПараметрыУведомления = Новый Структура("Уведомление, ТаблицаКлиентов, КодСубброкера", Уведомление, WTRCСообщенияQI.ТаблицаКлиентов(), ДанныеЗаполнения.КодЗагрузки);
	СтрокаКлиента = ПараметрыУведомления.ТаблицаКлиентов.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаКлиента,ДанныеЗаполнения);
		
	ЗапросСубброкеруОбъект = ЗапросНаРаскрытие.ПолучитьОбъект();
	Если ЗначениеЗаполнено(ЗапросСубброкеруОбъект.КД) Тогда 
		ИспользоватьРегистрациюЗапросовСубброкера = WTRCСообщенияQI.ИспользоватьРегистрациюЗапросовСубброкераДляДокумента(ЗапросСубброкеруОбъект.КД);
	Иначе 
		ИспользоватьРегистрациюЗапросовСубброкера = WTRCСообщенияQI.ИспользоватьРегистрациюЗапросовСубброкераДляДокумента(ЗапросСубброкеруОбъект.РСВ);
	КонецЕсли;
	МВТ = Новый МенеджерВременныхТаблиц;
	Документы.ЗапросСубброкеруНаРаскрытие.ДобавитьИсточникДляРаскрытияИзЗапросаНаРСВ(МВТ, ЗапросНаРаскрытие);
	Данные = WTRCСообщенияQI.ДанныеДляЗаполненияЗапросовНаРаскрытиеПоСубклиентам(МВТ, ДатаФиксации);
	ДополнитьДанныеИзЗапросаНаРаскрытие(Данные,ЗапросНаРаскрытие);
	Если ФорматВыгружаемогоФайла(ДанныеЗаполнения) = Перечисления.ФорматЗапросовИРСВ.XLS Тогда
		ФайлРасшифровки = WTRCСообщенияQI.ФайлРасшифровкиЗапросаСубброкераНаРаскрытие(Данные, ИспользоватьРегистрациюЗапросовСубброкера);
		Документы.РаскрытиеСпискаВладельцев.ПрисоединитьФайлКЗапросуНаРСВ(ЗапросНаРаскрытие, ФайлРасшифровки, "Раскрытие списка владельцев.xlsx", ".xlsx");
	Иначе
		ФайлРасшифровки = WTRCСообщенияQI.ФайлРасшифровкиЗапросаСубброкераНаРаскрытиеXML(ДанныеЗаполнения);
		Если ФайлРасшифровки <> Неопределено Тогда
			ИмяФайлаXML = ИмяФайлаРСВXML(ДанныеЗаполнения);
			Документы.РаскрытиеСпискаВладельцев.ПрисоединитьФайлКЗапросуНаРСВ(ЗапросНаРаскрытие, ФайлРасшифровки, ИмяФайлаXML, ".xml");
		КонецЕсли;
	КонецЕсли;
	ФайлЗапроса = WTRCСообщенияQI.ФайлЗапросаНаРаскрытиеПоСубклиентамПриложение2_5(Данные, ЗапросНаРаскрытие);
	Документы.РаскрытиеСпискаВладельцев.ПрисоединитьФайлКЗапросуНаРСВ(ЗапросНаРаскрытие, ФайлЗапроса, "Приложение 02.5. Запрос на раскрытие списка владельцев ценных бумаг.pdf", ".pdf");
	Успешно = Документы.РаскрытиеСпискаВладельцев.РезультатОтправкиЗапросаПоЭлПочте(Данные[0], ФайлЗапроса, ФайлРасшифровки);
	
	Если Не Успешно Тогда
		ТекстСообщения = "Не удалось отправить файлы раскрытия списка владельцев для документа " + ЗапросНаРаскрытие;
		ЗаписьЖурналаРегистрации("Отправка запроса субброкеру на раскрытие",УровеньЖурналаРегистрации.Предупреждение,Метаданные.Документы.ЗапросСубброкеруНаРаскрытие,ЗапросНаРаскрытие,ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ); 
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	ЗапросСубброкеруОбъект.ДатаВремяОтправкиЗапроса = ТекущаяДатаСеанса();
	Если ДанныеЗаполнения.ПовторныйЗапрос Тогда 
		ЗапросСубброкеруОбъект.Статус = Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.ОтправленПовторно;
	Иначе 
		ЗапросСубброкеруОбъект.Статус = Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.Отправлен;
	КонецЕсли;
	ЗапросСубброкеруОбъект.Записать();
	
	Если ДанныеЗаполнения.ВидКДКод = "TREC" Или ДанныеЗаполнения.ВидКДКод = "WTRC" Тогда
		УведомлениеКлиентам = Документы.УведомлениеКлиентам.УведомлениеПоТексту(ЗапросНаРаскрытие.РСВ, Уведомление.ФормаСообщенияКК, Уведомление.Тело);
	Иначе
		УведомлениеКлиентам = Неопределено;
	КонецЕсли;

	Если УведомлениеКлиентам = Неопределено Тогда
		ДокументУведомление = Документы.УведомлениеКлиентам.СоздатьДокумент();
		ДокументУведомление.УстановитьСсылкуНового(Документы.УведомлениеКлиентам.ПолучитьСсылку());
		ДокументУведомление.Дата = ТекущаяДата();
		ДокументУведомление.УстановитьНовыйНомер();	
		ДокументУведомление.Заполнить(ЗапросНаРаскрытие);
		ДокументУведомление.ЗаголовокСообщения = Уведомление.Тема;
		ДокументУведомление.ТелоСообщения = Уведомление.Тело;
		ДокументУведомление.ФормаСообщенияКК = Уведомление.ФормаСообщенияКК;
		Если ЗначениеЗаполнено(ЗапросНаРаскрытие.РСВ) Тогда 
			ДокументУведомление.ДокументОснование = ЗапросНаРаскрытие.РСВ;
		Иначе 
			ДокументУведомление.ДокументОснование = ЗапросНаРаскрытие.КД;
		КонецЕсли;
		ДокументУведомление.Статус = Перечисления.СтатусыУведомленийКлиентам.Отправлено;
	Иначе 
		ДокументУведомление = УведомлениеКлиентам.ПолучитьОбъект();
	КонецЕсли;	
	
	Успешно = ДокументУведомление.РезультатПодготовкиКОтправкеВЛКSendEmailToClients(ПараметрыУведомления);
	Если Успешно Тогда
		ДокументУведомление.Записать();
		РегистрыСведений.УведомленияОтправленныеЧерезЛичныйКабинет.ЗафиксироватьУведомления(ДокументУведомление.Дата,
		ЗапросНаРаскрытие, ПараметрыУведомления.ТаблицаКлиентов);
	Иначе
		ТекстСообщения = "Не удалось отправить уведомление клиенту в ЛК по запросу " + ЗапросНаРаскрытие;
		ЗаписьЖурналаРегистрации("Отправка запроса субброкеру на раскрытие", УровеньЖурналаРегистрации.Предупреждение,Метаданные.Документы.ЗапросСубброкеруНаРаскрытие, ЗапросНаРаскрытие, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ); 
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	Если ЗначениеЗаполнено(ЗапросНаРаскрытие.РСВ) Тогда 
		РСВОбъект = ЗапросНаРаскрытие.РСВ.ПолучитьОбъект();
		Попытка
			РСВОбъект.Заблокировать();
		Исключение
			ТекстСообщения  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Не удалось изменить документ %1, возможно он открыт. Закройте документ и повторите попытку.", РСВОбъект.Ссылка);
			ЗаписьЖурналаРегистрации("Отправка запроса субброкеру на раскрытие", УровеньЖурналаРегистрации.Предупреждение,Метаданные.Документы.РаскрытиеСпискаВладельцев, РСВОбъект.Ссылка, ТекстСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;	
		РСВОбъект.ЗаполнитьСписокВладельцев();
		РСВОбъект.Записать();
		РСВОбъект.Разблокировать();
	КонецЕсли;	
	
КонецПроцедуры

Функция ФорматВыгружаемогоФайла(ДанныеЗаполнения) 
	
	Если ДанныеЗаполнения.Клиент.ФорматЗапросовИРСВ = Перечисления.ФорматЗапросовИРСВ.XML
		И ДанныеЗаполнения.РСВ.ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.FCDR_2017_02 Тогда
		Возврат Перечисления.ФорматЗапросовИРСВ.XML;
	Иначе
		Возврат Перечисления.ФорматЗапросовИРСВ.XLS;
	КонецЕсли;
	
КонецФункции

Функция ИмяФайлаРСВXML(ДанныеЗаполнения)
	ЗапросСубброкеру = ДанныеЗаполнения.ЗапросСубброкеруСсылка;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗапросСубброкеруНаРаскрытие.Номер КАК Номер,
	|	ЗапросСубброкеруНаРаскрытие.РеференсКД КАК РеференсКД,
	|	ЗапросСубброкеруНаРаскрытие.СчетДЕПО.НомерДепозитарногоДоговора КАК НомерДепозитарногоДоговора,
	|	ЗапросСубброкеруНаРаскрытие.ВидКД.Код КАК Код,
	|	СУММА(ВЫБОР
	|			КОГДА ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.РазделСчетаДепо.Код ПОДОБНО ""%[_]%""
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) > 0 КАК ЕстьСегрегированныйРаздел,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.РазделСчетаДепо.Код ПОДОБНО ""%[_]%""
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) > 0 КАК ЕстьОбщийРаздел
	|ИЗ
	|	Документ.ЗапросСубброкеруНаРаскрытие.ДанныеСубброкера КАК ЗапросСубброкеруНаРаскрытиеДанныеСубброкера
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
	|		ПО ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.Ссылка = ЗапросСубброкеруНаРаскрытие.Ссылка
	|ГДЕ
	|	ЗапросСубброкеруНаРаскрытие.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапросСубброкеруНаРаскрытие.Номер,
	|	ЗапросСубброкеруНаРаскрытие.РеференсКД,
	|	ЗапросСубброкеруНаРаскрытие.СчетДЕПО.НомерДепозитарногоДоговора,
	|	ЗапросСубброкеруНаРаскрытие.ВидКД.Код";
	Запрос.УстановитьПараметр("Ссылка", ЗапросСубброкеру);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	НомерДоговора = СокрЛП(Выборка.НомерДепозитарногоДоговора);
	КодВидаКД = Выборка.Код;
	КДРеференс = Выборка.РеференсКД;
	НомерЗапроса = Прав(Выборка.Номер, СтрНайти(Выборка.Номер, "-", НаправлениеПоиска.СКонца) - 2);
	Пока Лев(НомерЗапроса, 1) = "0" Цикл
		НомерЗапроса = Прав(НомерЗапроса, СтрДлина(НомерЗапроса) - 1);
	КонецЦикла;
	
	Если Выборка.ЕстьСегрегированныйРаздел И Выборка.ЕстьОбщийРаздел Тогда
		ТипРаздела = "VO";
	ИначеЕсли Выборка.ЕстьСегрегированныйРаздел Тогда
		ТипРаздела = "V";
	Иначе
		ТипРаздела = "O";
	КонецЕсли;
	
	Возврат "" + НомерДоговора + "_" + КодВидаКД + "_" + КДРеференс + "_" + НомерЗапроса + "_" + ТипРаздела + ".xml";
	
КонецФункции

// Формирует и отправляет на электронную почту XLSX-файлы расшифровки запроса субброкера на раскрытие для указанных документов
//
// Параметры:
//  ЗапросыСубброкеруНаРаскрытие - ДокументСсылка.ЗапросСубброкеруНаРаскрытие, ДокументСсылка.РаскрытиеСпискаВладельцев, Массив
//  	- документ или массив документов для которых нужно сформировать и отправить файлы
//  Отказ						 - Булево	 - признак отказа при выполнении операции
//  Тестирование				 - Булево	 - если установлен в Истину, то для отправки будет использована обработка TEST_ВебСервисы
//
Процедура ОтправитьЗапросСубброкеруНаРаскрытие(ЗапросыСубброкеруНаРаскрытие, Отказ, Тестирование = Ложь) Экспорт 

	ДокументыКОтправке = Новый Массив();
	Если ТипЗнч(ЗапросыСубброкеруНаРаскрытие) = Тип("Массив") Тогда 
		Для Каждого ЭлементМассива Из ЗапросыСубброкеруНаРаскрытие Цикл 
			ДобавитьДокументЗапросСубброкераКОтправке(ДокументыКОтправке, ЭлементМассива);		
		КонецЦикла;
	Иначе
		ДобавитьДокументЗапросСубброкераКОтправке(ДокументыКОтправке,ЗапросыСубброкеруНаРаскрытие);
	КонецЕсли;
	
	ДанныеЗаполнения = ДанныеЗаполненияУведомленийИЗапросовКОтправке(ДокументыКОтправке);
	Пока ДанныеЗаполнения.Следующий() Цикл 
		
		ЗапросНаРаскрытие = ДанныеЗаполнения.ЗапросСубброкеруСсылка;
		Если ДанныеЗаполнения.ВидКДКод = "TREC" Или ДанныеЗаполнения.ВидКДКод = "WTRC" Тогда
			ЗапросСубброкеруОбъект = ДанныеЗаполнения.ЗапросСубброкеруСсылка.ПолучитьОбъект();
			ЗапросСубброкеруОбъект.Отправить();
			Отказ =  Не (ЗапросСубброкеруОбъект.Статус = Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.Отправлен 
				Или ЗапросСубброкеруОбъект.Статус = Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.ОтправленПовторно);
		Иначе 
			ОтправитьЗапросСубброкераИУведомлениеКлиентам(ДанныеЗаполнения, Отказ, Тестирование);
		КонецЕсли;
		Если Отказ Тогда 
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция - Создать запросы субброкеру на раскрытие trec
// Создает документы запроса субброкеру на раскрытие
// Параметры:
//  КорпоративноеДействиеНовыйСсылка - ДокументСсылка.КорпоративноеДействие_Новый	- Корпоративное действие по которому создаем запрос
//  УведомлениеКлиентамОбъект		 - ДокументСсылка.УведомлениеКлиентам	 		- Уведомление клентам в рамках которого создаем запрос субброкеур на раскрытие
//  Клиенты							 - Массив	 									- Обязательно при отправке уведомление о расхождении. Массив клиентов с изменившимися остатками для которых будут сформированы повторные в запросы субброкеру
// 
// Возвращаемое значение:
//   - 
//
Функция  СоздатьЗапросыСубброкеруНаРаскрытиеTrec(КорпоративноеДействиеНовыйСсылка, УведомлениеКлиентамОбъект, Клиенты = Неопределено) Экспорт 
	
	СозданыеДокументы = Новый Массив();	
	РеквизитыКорпоративногоДействия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КорпоративноеДействиеНовыйСсылка,
	"Дата, ДатаФиксации, ЦеннаяБумага1, ЦеннаяБумага2, СчетДЕПО, ВидКД, КДРеференс, КДРеференсСвязанный");
	
	МВТ = Новый МенеджерВременныхТаблиц;

	Если УведомлениеКлиентамОбъект.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВозвратЧастиНалогаНДИНД
		И РеквизитыКорпоративногоДействия.ВидКД.Код = "TREC"
		И WTRCСообщенияQI.ИспользоватьРегистрациюЗапросовСубброкера(РеквизитыКорпоративногоДействия.Дата) Тогда
		Документы.КорпоративноеДействие_Новый.ДобавитьИсточникДляРаскрытияИзКД(МВТ, КорпоративноеДействиеНовыйСсылка);
	ИначеЕсли  УведомлениеКлиентамОбъект.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбИзмененииОстатковЦБ Тогда
		Документы.КорпоративноеДействие_Новый.ДобавитьИсточникДляРаскрытияИзКД(МВТ, КорпоративноеДействиеНовыйСсылка, Клиенты);
	Иначе 
		Возврат СозданыеДокументы;
	КонецЕсли;

	ДатаОстатков = РеквизитыКорпоративногоДействия.ДатаФиксации;
	Если УведомлениеКлиентамОбъект.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбИзмененииОстатковЦБ Тогда 
		ДатаОстатков = ТекущаяДатаСеанса();
	ИначеЕсли Не ЗначениеЗаполнено(ДатаОстатков) ИЛИ ДатаОстатков < ТекущаяДатаСеанса() Тогда 
		ДатаОстатков = РеквизитыКорпоративногоДействия.Дата;
	КонецЕсли;
	
	СписокЦенныхБумаг = Новый Массив();
	Если ЗначениеЗаполнено(РеквизитыКорпоративногоДействия.ЦеннаяБумага1) Тогда 
		СписокЦенныхБумаг.Добавить(РеквизитыКорпоративногоДействия.ЦеннаяБумага1);
	КонецЕсли;
	Если ЗначениеЗаполнено(РеквизитыКорпоративногоДействия.ЦеннаяБумага2) Тогда 
		СписокЦенныхБумаг.Добавить(РеквизитыКорпоративногоДействия.ЦеннаяБумага2);
	КонецЕсли;

	Данные = WTRCСообщенияQI.ДанныеДляЗаполненияЗапросовНаРаскрытиеПоСубклиентам(МВТ, КорпоративноеДействиеНовыйСсылка.ДатаФиксации);	
	Субброкеры = Данные.Скопировать(, "КодСубброкера, НД, ИНД");
	Субброкеры.Свернуть("КодСубброкера, НД, ИНД");
	Для Каждого Субброкер Из Субброкеры Цикл
		Если Субброкер.НД = Ложь И Субброкер.ИНД = Ложь Тогда 
			Продолжить;
		КонецЕсли;
		
		ДанныеПоСубброкеру = Данные.НайтиСтроки(Новый Структура("КодСубброкера", Субброкер.КодСубброкера));
		ЗапросНаРаскрытие = НовыйДокументЗапросСубброкеруНаРаскрытиеИзКД(КорпоративноеДействиеНовыйСсылка, УведомлениеКлиентамОбъект, ДанныеПоСубброкеру);
		Если ТипЗнч(СозданыеДокументы) = Тип("Массив") Тогда 
			СозданыеДокументы.Добавить(ЗапросНаРаскрытие);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СозданыеДокументы;
	
КонецФункции

// Процедура - Создать и отправить запросы субброкеру на раскрытие trec после наступления даты фиксации
// Процедура выбирает корпоративные действия TREC у которых уже неаступила дата фиксации и отправляет уведомления с активной ссылкой, если это необходимо.
Процедура СоздатьИОтправитьЗапросыСубброкеруНаРаскрытиеTrecПослеНаступленияДатыФиксации() Экспорт 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КорпоративноеДействие_Новый.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ КорпоративныеДействия
	|ИЗ
	|	Документ.КорпоративноеДействие_Новый КАК КорпоративноеДействие_Новый
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(КорпоративноеДействие_Новый.ДатаФиксации, ДЕНЬ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), ДЕНЬ, -1)
	|	И КорпоративноеДействие_Новый.ВидКД = &ВидКДTrec
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(УведомлениеКлиентам.ДокументОснование КАК Документ.КорпоративноеДействие_Новый) КАК Ссылка
	|ПОМЕСТИТЬ КорпоративныеДействияСАктивнойСсылкой
	|ИЗ
	|	Документ.УведомлениеКлиентам КАК УведомлениеКлиентам
	|ГДЕ
	|	УведомлениеКлиентам.ДокументОснование ССЫЛКА Документ.КорпоративноеДействие_Новый
	|	И УведомлениеКлиентам.ДокументОснование В
	|			(ВЫБРАТЬ
	|				КорпоративныеДействия.Ссылка
	|			ИЗ
	|				КорпоративныеДействия КАК КорпоративныеДействия)
	|	И УведомлениеКлиентам.АктивнаяСсылка = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(УведомлениеКлиентам.ДокументОснование КАК Документ.КорпоративноеДействие_Новый)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорпоративныеДействия.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА КорпоративныеДействияСАктивнойСсылкой.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК АктивнаяСсылка
	|ИЗ
	|	КорпоративныеДействия КАК КорпоративныеДействия
	|		ЛЕВОЕ СОЕДИНЕНИЕ КорпоративныеДействияСАктивнойСсылкой КАК КорпоративныеДействияСАктивнойСсылкой
	|		ПО КорпоративныеДействия.Ссылка = КорпоративныеДействияСАктивнойСсылкой.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА КорпоративныеДействияСАктивнойСсылкой.Ссылка ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ВидКДTrec", Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("TREC"));
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат;	
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		НачатьТранзакцию();
		УведомлениеКлиента = Документы.УведомлениеКлиентам.СоздатьДокумент();
		УведомлениеКлиента.УстановитьНовыйНомер();
		УведомлениеКлиента.УстановитьСсылкуНового(Документы.УведомлениеКлиентам.ПолучитьСсылку());
		УведомлениеКлиента.Дата = ТекущаяДата();
		УведомлениеКлиента.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВозвратЧастиНалогаНДИНД;
		УведомлениеКлиента.Заполнить(Выборка.Ссылка);
		
		ИдентичноеУведомление = Документы.УведомлениеКлиентам.ИдентичноеУведомление(Выборка.Ссылка, УведомлениеКлиента);
		Если ЗначениеЗаполнено(ИдентичноеУведомление) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("С данными реквизитами уведомление уже сформировано: " + ИдентичноеУведомление);
			Если ТранзакцияАктивна() Тогда 
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
		КонецЕсли;

		УведомлениеКлиента.Записать();
		Если ТранзакцияАктивна() Тогда 
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		КонецЦикла;
	
КонецПроцедуры

// Процедура - Создать и отправить запросы субброкеру на раскрытие trec при изменении остатков
// Процедура выбирает корпоративные действия TREC у которых через 3 дня наступит дата окончания приема уведомлений, сверяет остатки и в случае их изменения с момента отправки уведомления формирует новое уведомление об изменении остатков.
Процедура СоздатьИОтправитьЗапросыСубброкеруНаРаскрытиеTrecПриИзмененииОстатков() Экспорт 
	
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	ДатаОкончанияПриемаИнструкцийНРД3РабочихДня = ОбщегоНазначения.ДобавитьРабочийКалендарныйДень(ТекущаяДата,3);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КорпоративноеДействие_Новый.Ссылка КАК Ссылка,
	|	КорпоративноеДействие_Новый.ДатаФиксации КАК ДатаФиксации,
	|	КорпоративноеДействие_Новый.СчетДЕПО КАК СчетДЕПО,
	|	КорпоративноеДействие_Новый.ЦеннаяБумага1 КАК ЦеннаяБумага
	|ПОМЕСТИТЬ КорпоративныеДействияTrecЗа3ДняДоДатаОкончанияПриемаИнструкцийНРД
	|ИЗ
	|	Документ.КорпоративноеДействие_Новый КАК КорпоративноеДействие_Новый
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(КорпоративноеДействие_Новый.ДатаОкончанияПриемаИнструкцийНРД, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаОкончанияПриемаИнструкцийНРД3РабочихДня, ДЕНЬ)
	|	И КорпоративноеДействие_Новый.ВидКД = &ВидКДTrec
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УведомлениеКлиентам.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ УведомленияОбИзмененииОстатков
	|ИЗ
	|	Документ.УведомлениеКлиентам КАК УведомлениеКлиентам
	|ГДЕ
	|	УведомлениеКлиентам.ДокументОснование В
	|			(ВЫБРАТЬ
	|				КорпоративныеДействияTrecЗа3ДняДоДатаОкончанияПриемаИнструкцийНРД.Ссылка
	|			ИЗ
	|				КорпоративныеДействияTrecЗа3ДняДоДатаОкончанияПриемаИнструкцийНРД КАК КорпоративныеДействияTrecЗа3ДняДоДатаОкончанияПриемаИнструкцийНРД)
	|	И УведомлениеКлиентам.ФормаСообщенияКК = &ФормаСообщенияККОбИзмененииОстатковЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорпоративноеДействие_Новый.Ссылка КАК Ссылка,
	|	КорпоративноеДействие_Новый.Ссылка.ДатаФиксации КАК ДатаФиксации,
	|	КорпоративноеДействие_Новый.Ссылка.СчетДЕПО КАК СчетДЕПО,
	|	КорпоративноеДействие_Новый.Ссылка.ЦеннаяБумага1 КАК ЦеннаяБумага
	|ПОМЕСТИТЬ КорпоративныеДействия
	|ИЗ
	|	КорпоративныеДействияTrecЗа3ДняДоДатаОкончанияПриемаИнструкцийНРД КАК КорпоративноеДействие_Новый
	|ГДЕ
	|	НЕ КорпоративноеДействие_Новый.Ссылка В
	|				(ВЫБРАТЬ
	|					УведомленияОбИзмененииОстатков.ДокументОснование
	|				ИЗ
	|					УведомленияОбИзмененииОстатков КАК УведомленияОбИзмененииОстатков)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапросСубброкеруНаРаскрытие.КД КАК КорпоративноеДействие,
	|	ЗапросСубброкеруНаРаскрытие.Клиент КАК Клиент,
	|	МАКСИМУМ(ЗапросСубброкеруНаРаскрытие.ДатаВремяОтправкиЗапроса) КАК ДатаОтправки
	|ПОМЕСТИТЬ ДатаИВремяОтправкиЗапросов
	|ИЗ
	|	Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
	|ГДЕ
	|	ЗапросСубброкеруНаРаскрытие.КД В
	|			(ВЫБРАТЬ
	|				КорпоративныеДействия.Ссылка
	|			ИЗ
	|				КорпоративныеДействия КАК КорпоративныеДействия)
	|	И ЗапросСубброкеруНаРаскрытие.Статус В(&СтатусОтправлено)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапросСубброкеруНаРаскрытие.КД,
	|	ЗапросСубброкеруНаРаскрытие.Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатаИВремяОтправкиЗапросов.КорпоративноеДействие КАК КорпоративноеДействие,
	|	ДатаИВремяОтправкиЗапросов.Клиент КАК Клиент,
	|	ДатаИВремяОтправкиЗапросов.КорпоративноеДействие.ЦеннаяБумага1 КАК ЦеннаяБумага,
	|	ЗапросСубброкеруНаРаскрытие.Ссылка КАК ЗапросСубброкеру,
	|	ЗапросСубброкеруНаРаскрытие.СчетДЕПО КАК СчетДЕПО,
	|	ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.Количество КАК Количество
	|ПОМЕСТИТЬ ОстаткиВЗапросеСубброкера
	|ИЗ
	|	ДатаИВремяОтправкиЗапросов КАК ДатаИВремяОтправкиЗапросов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
	|			ПРАВОЕ СОЕДИНЕНИЕ Документ.ЗапросСубброкеруНаРаскрытие.ДанныеСубброкера КАК ЗапросСубброкеруНаРаскрытиеДанныеСубброкера
	|			ПО (ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.Ссылка = ЗапросСубброкеруНаРаскрытие.Ссылка)
	|		ПО ДатаИВремяОтправкиЗапросов.КорпоративноеДействие = ЗапросСубброкеруНаРаскрытие.КД
	|			И ДатаИВремяОтправкиЗапросов.Клиент = ЗапросСубброкеруНаРаскрытие.Клиент
	|			И ДатаИВремяОтправкиЗапросов.ДатаОтправки = ЗапросСубброкеруНаРаскрытие.ДатаВремяОтправкиЗапроса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБОстатки.ЦБ КАК ЦеннаяБумага,
	|	ОстаткиЦБОстатки.СчетДепо КАК СчетДепо,
	|	ОстаткиЦБОстатки.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОстаткиЦБОстатки.КоличествоОстаток КАК Остаток
	|ПОМЕСТИТЬ ТекущиеОстаткиЦБ
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБМестоРасчетов.Остатки(
	|			&ТекущаяДата,
	|			СчетДепоМХ В
	|					(ВЫБРАТЬ
	|						КорпоративныеДействия.СчетДЕПО
	|					ИЗ
	|						КорпоративныеДействия КАК КорпоративныеДействия)
	|				И ЦБ В
	|					(ВЫБРАТЬ
	|						КорпоративныеДействия.ЦеннаяБумага
	|					ИЗ
	|						КорпоративныеДействия КАК КорпоративныеДействия)
	|				И СчетДепо.ТипСчетаДепо В (&ТипСчетаНДИНД)) КАК ОстаткиЦБОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиВЗапросеСубброкера.КорпоративноеДействие КАК КорпоративноеДействие,
	|	ОстаткиВЗапросеСубброкера.Клиент КАК Клиент,
	|	СУММА(ОстаткиВЗапросеСубброкера.Количество) КАК КоличествоВЗапросе,
	|	СУММА(ТекущиеОстаткиЦБ.Остаток) КАК ТекущийОстаток
	|ИЗ
	|	ОстаткиВЗапросеСубброкера КАК ОстаткиВЗапросеСубброкера
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТекущиеОстаткиЦБ КАК ТекущиеОстаткиЦБ
	|		ПО ОстаткиВЗапросеСубброкера.ЦеннаяБумага = ТекущиеОстаткиЦБ.ЦеннаяБумага
	|			И ОстаткиВЗапросеСубброкера.СчетДЕПО = ТекущиеОстаткиЦБ.СчетДепо
	|			И ОстаткиВЗапросеСубброкера.РазделСчетаДепо = ТекущиеОстаткиЦБ.РазделСчетаДепо
	|ГДЕ
	|	ОстаткиВЗапросеСубброкера.Количество <> ТекущиеОстаткиЦБ.Остаток
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиВЗапросеСубброкера.КорпоративноеДействие,
	|	ОстаткиВЗапросеСубброкера.Клиент
	|ИТОГИ ПО
	|	КорпоративноеДействие");

	
	СтатусОтправлено = Новый Массив();
	СтатусОтправлено.Добавить(Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.Отправлен);
	СтатусОтправлено.Добавить(Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.ОтправленПовторно);
	СтатусОтправлено.Добавить(Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.ПолученОтвет);
	Запрос.УстановитьПараметр("ДатаОкончанияПриемаИнструкцийНРД3РабочихДня",ДатаОкончанияПриемаИнструкцийНРД3РабочихДня);
	Запрос.УстановитьПараметр("ВидКДTrec", Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("TREC"));
	Запрос.УстановитьПараметр("СтатусОтправлено", СтатусОтправлено);
	Запрос.УстановитьПараметр("ФормаСообщенияККОбИзмененииОстатковЦБ", Перечисления.ФормыСообщенийКК.ОбИзмененииОстатковЦБ);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТипСчетаНДИНД", БизнесПроцессы.ОбработкаWTRCСообщения.ТипыСчетовНДИНД());
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат;	
	КонецЕсли;
	
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл 
		
			Клиенты = Новый Массив();	
			ВыборкаДетальныеЗаписи = Выборка.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
				Клиенты.Добавить(ВыборкаДетальныеЗаписи.Клиент);	
			КонецЦикла;
			
			ДанныеЗаполнения = Новый Структура("Основание, Клиенты", Выборка.КорпоративноеДействие, Клиенты);
			НачатьТранзакцию();
			УведомлениеКлиента = Документы.УведомлениеКлиентам.СоздатьДокумент();
			УведомлениеКлиента.УстановитьНовыйНомер();
			УведомлениеКлиента.УстановитьСсылкуНового(Документы.УведомлениеКлиентам.ПолучитьСсылку());
			УведомлениеКлиента.Дата = ТекущаяДатаСеанса();
			УведомлениеКлиента.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбИзмененииОстатковЦБ;
			УведомлениеКлиента.Заполнить(ДанныеЗаполнения);
			УведомлениеКлиента.Записать();
			Если ТранзакцияАктивна() Тогда 
				ЗафиксироватьТранзакцию();
			КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

// Создает новый, заполняет и записывает документ ЗапросСубброкеруНаРаскрытие по данным КД WTRC
// Параметры:
//  КорпоративноеДействие	 - ДокументСсылка.КорпоративноеДействие_Новый	- Корпоративное дейсвтие в рамках которого создается запрос
//  УведомлениеКлиентам		 - ДокументСсылка.УведомлениеКлиентам	 		- Уведомление клиентам на основании которого создается запрос
//  ДанныеПоСубброкеру		 - Массив	 									- Массив строк таблицы значений сгенерированной в WTRCСообщенияQI.ДанныеДляЗаполненияЗапросовНаРаскрытиеПоСубклиентам отобранных по текущему клиенту
//  ЭтоАмериканскаяЦБ			 - Булево	 									- Флаг указывающий попадает ли ЦБ под налоговое регулирование США
// 
// Возвращаемое значение:
// ДокументСсылка.ЗапросСубброкеруНаРаскрытие
//
Функция ЗапросСубброкеруНаРаскрытиеЗаполненныйWTRC(КорпоративноеДействие, УведомлениеКлиентам, ДанныеПоСубброкеру, ЭтоАмериканскаяЦБ) Экспорт
	
	ДанныеСубброкера = ДанныеПоСубброкеру[0];
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗапросСубброкеруНаРаскрытие.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
	|ГДЕ
	|	ЗапросСубброкеруНаРаскрытие.КД = &КД
	|	И ЗапросСубброкеруНаРаскрытие.Клиент = &Клиент
	|	И НЕ ЗапросСубброкеруНаРаскрытие.ПометкаУдаления";
	Запрос.УстановитьПараметр("КД", КорпоративноеДействие);
	Запрос.УстановитьПараметр("Клиент", ДанныеСубброкера.Субброкер);
	Результат = Запрос.Выполнить();
	ПовторныйЗапрос = Не Результат.Пустой();
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УведомлениеКлиентам.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УведомлениеКлиентам КАК УведомлениеКлиентам
	|ГДЕ
	|	УведомлениеКлиентам.ДокументОснование = &КД
	|	И УведомлениеКлиентам.ПометкаУдаления = ЛОЖЬ
	|	И УведомлениеКлиентам.ТелоСообщения ПОДОБНО &ТелоСообщения";
	Запрос.УстановитьПараметр("ТелоСообщения", УведомлениеКлиентам.Тело);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
	 	Выборка.Следующий();  
		УведомлениеКлиентамСсылка = Выборка.Ссылка;
	КонецЕсли;
	
	РеквизитыКорпоративногоДействия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КорпоративноеДействие
		,Новый Структура("Дата, ДатаОкончанияПриемаИнструкцийНРД, ВидКД, КДРеференсСвязанный, КДРеференсСвязанныйСсылка, КДРеференсСвязанныйВид, ДатаФиксации"
		,"Дата", "ДатаОкончанияПриемаИнструкцийНРД", "ВидКД", "КДРеференсСвязанный", "КДРеференсСвязанныйСсылка", "КДРеференсСвязанныйСсылка.ВидКД", "ДатаФиксации"));
	ТекущаяДата = ТекущаяДатаСеанса();
	ДокументРСВ = РСВПоКД(КорпоративноеДействие);
	ДокЗапросНаРСВ = Документы.ЗапросСубброкеруНаРаскрытие.СоздатьДокумент();
	ДокЗапросНаРСВ.УведомлениеКлиентам = УведомлениеКлиентамСсылка;
	ДокЗапросНаРСВ.Дата = ТекущаяДата;
	ДокЗапросНаРСВ.РСВ = ДокументРСВ;
	ДокЗапросНаРСВ.УстановитьНовыйНомер();
	ДокЗапросНаРСВ.Клиент = ДанныеСубброкера.Субброкер;
	ДокЗапросНаРСВ.КодLEI = ДанныеСубброкера.LEIКодСубброкера;
	ДокЗапросНаРСВ.СчетДЕПО = ДанныеСубброкера.СчетДепо;
	ДокЗапросНаРСВ.РеференсКД = ДанныеСубброкера.КДРеференс;
	ДокЗапросНаРСВ.ВидКД = РеквизитыКорпоративногоДействия.ВидКД;
	ДокЗапросНаРСВ.КодТипаКорпоративногоДействия = ДокЗапросНаРСВ.ВидКД;
	ДокЗапросНаРСВ.КД = КорпоративноеДействие;
	Если ЗначениеЗаполнено(РеквизитыКорпоративногоДействия.КДРеференсСвязанныйСсылка) Тогда
		ДокЗапросНаРСВ.КДСвязанный = РеквизитыКорпоративногоДействия.КДРеференсСвязанныйСсылка;
		ДокЗапросНаРСВ.РеференсКДСвязанный = РеквизитыКорпоративногоДействия.КДРеференсСвязанный;
		ДокЗапросНаРСВ.ВидКДСвязанный = РеквизитыКорпоративногоДействия.КДРеференсСвязанныйВид;
	КонецЕсли;
	ДокЗапросНаРСВ.ДатаСпискаЛиц = РеквизитыКорпоративногоДействия.ДатаФиксации;
	ДокЗапросНаРСВ.ПолноеНаименованиеЭмитента = ДанныеСубброкера.ПолноеНаименованиеЭмитента;
	ДокЗапросНаРСВ.ISIN = ДанныеСубброкера.ISIN;
	ДокЗапросНаРСВ.ГосРегНомерВыпуска = ДанныеСубброкера.ГосРегНомерВыпуска;
	ДокЗапросНаРСВ.ПовторныйЗапрос = ПовторныйЗапрос;
	ДокЗапросНаРСВ.Статус = Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.Сформирован;	
	ДокЗапросНаРСВ.ЗаголовокСообщения = УведомлениеКлиентам.Тема;
	ДокЗапросНаРСВ.ТелоСообщения = УведомлениеКлиентам.Тело;
	
	Для Каждого Стр Из ДанныеПоСубброкеру Цикл
		НоваяСтрока = ДокЗапросНаРСВ.ДанныеСубброкера.Добавить();
				
		Если ЭтоАмериканскаяЦБ Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр, "КодКлиента, РазделСчетаДепо, ПризнакЮЛФЛ, ISIN, Количество");
		ИначеЕсли Стр.РазделСчетаДепо.РазделСубклиента Тогда  
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр,, "КодКлиента");
		Иначе 
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр, "ISIN, LEIКодСубброкера, КодНРД, Количество, РазделСчетаДепо");
		КонецЕсли;
		
		НоваяСтрока.Выгодоприобретатель = Стр.Субклиент;
		НоваяСтрока.ПолноеНаименованиеЛица = Стр.ПолноеНаименованиеЮЛФЛСубклиента;
		
		// Для уведомления 12 об изменении остатков указываем изменившиеся количество
		Если УведомлениеКлиентам.НомерУведомления = 12 Тогда
			СтрокаСИзмененнымиОстатками = УведомлениеКлиентам.Остатки.Найти(Стр.РазделСчетаДепо, "РазделСчета");
			Если СтрокаСИзмененнымиОстатками <> Неопределено Тогда 
				НоваяСтрока.Количество = СтрокаСИзмененнымиОстатками.Количество; 		
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	ДокЗапросНаРСВ.Записать();	
	Возврат ДокЗапросНаРСВ.Ссылка;
	
КонецФункции  

Функция РСВПоКД(КорпоративноеДействие)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РаскрытиеСпискаВладельцев.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев КАК РаскрытиеСпискаВладельцев
	|ГДЕ
	|	РаскрытиеСпискаВладельцев.КарточкаКД = &КарточкаКД
	|	И НЕ РаскрытиеСпискаВладельцев.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	РаскрытиеСпискаВладельцев.Дата УБЫВ";
	Запрос.УстановитьПараметр("КарточкаКД", КорпоративноеДействие);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
